<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="latent_batch" type="Parameter" version="opset1">
			<data shape="?,8,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="latent_batch">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="timesteps" type="Parameter" version="opset1">
			<data shape="?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="timesteps">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="encoder_hidden_states" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.model.conv_in.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320, 8, 3, 3" offset="0" size="46080" />
			<output>
				<port id="0" precision="FP16" names="self.model.conv_in.weight">
					<dim>320</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="self.model.conv_in.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.model.conv_in/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.model.conv_in/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 320, 1, 1" offset="46080" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.model.conv_in/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.model.conv_in/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="94,input.7">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="self.model.down_blocks.0.resnets.0.norm1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320" offset="46720" size="640" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.resnets.0.norm1.weight">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="self.model.down_blocks.0.resnets.0.norm1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="self.model.down_blocks.0.resnets.0.norm1.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320" offset="47360" size="640" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.resnets.0.norm1.bias">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="self.model.down_blocks.0.resnets.0.norm1.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.model.down_blocks.0.resnets.0.norm1/aten::group_norm/GroupNormalization" type="GroupNormalization" version="opset12">
			<data num_groups="32" epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="112,input.9">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.model.conv_act/aten::silu/Swish" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="113,input.11">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="self.model.down_blocks.0.resnets.0.conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320, 320, 3, 3" offset="48000" size="1843200" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.resnets.0.conv1.weight">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="self.model.down_blocks.0.resnets.0.conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.model.down_blocks.0.resnets.0.conv1/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.model.down_blocks.0.resnets.0.conv1/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 320, 1, 1" offset="1891200" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.model.down_blocks.0.resnets.0.conv1/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.model.down_blocks.0.resnets.0.conv1/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="120,hidden_states.1">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="ShapeOf_60876" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_60877" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1891840" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_60878" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1891840" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="24" name="Gather_60879" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="3428,3431,3468,54">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="56,61,timesteps_1">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="28" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1891848" size="8" />
			<output>
				<port id="0" precision="I64" names="28" />
			</output>
		</layer>
		<layer id="27" name="__module.model.time_proj/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="62">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.model.time_proj/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="63">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.model.time_proj/aten::slice/Slice_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 160" offset="1891856" size="320" />
			<output>
				<port id="0" precision="FP16" names="65">
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.model.time_proj/aten::slice/Slice_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.model.time_proj/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="66,67,emb.3,emb.5">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.time_proj/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="68">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.time_proj/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="69">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.time_proj/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="71,72,74,emb">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_152" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1892176" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_154" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1892184" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_156" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1891848" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_150" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1891848" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.time_proj/aten::slice/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="73">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_172" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1891840" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_174" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1892176" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_176" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1891848" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_170" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1891848" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.time_proj/aten::slice/Slice_5" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="75">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.time_proj/aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="77,78,input.1,t_emb">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="self.model.time_embedding.linear_1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 320" offset="1892192" size="819200" />
			<output>
				<port id="0" precision="FP16" names="self.model.time_embedding.linear_1.weight">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="self.model.time_embedding.linear_1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.model.time_embedding.linear_1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_58345_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1280" offset="2711392" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_58345" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.time_embedding.linear_1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="83,input.3">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.conv_act/aten::silu/Swish_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="84,input.5">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="self.model.time_embedding.linear_2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280" offset="2713952" size="3276800" />
			<output>
				<port id="0" precision="FP16" names="self.model.time_embedding.linear_2.weight">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="self.model.time_embedding.linear_2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.model.time_embedding.linear_2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_58346_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1280" offset="5990752" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_58346" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.time_embedding.linear_2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="87,input.13">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.conv_act/aten::silu/Swish_2" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1171,121,1385,1424,1472,1670,1720,1769,1818,1891,2099,2307,2539,2747,2955,3185,319,3393,3601,540,745,966,input.135,input.15,input.175,input.215,input.255,input.271,input.287,input.327,input.343,input.359,input.375,input.393,input.433,input.473,input.515,input.55,input.555,input.595,input.637,input.677,input.717,input.95">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="self.model.down_blocks.0.resnets.0.time_emb_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320, 1280" offset="5993312" size="819200" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.resnets.0.time_emb_proj.weight">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="self.model.down_blocks.0.resnets.0.time_emb_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.down_blocks.0.resnets.0.time_emb_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_58347_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 320" offset="6812512" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_58347" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.down_blocks.0.resnets.0.time_emb_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="124,125,126">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6813152" size="8" />
			<output>
				<port id="0" precision="I64" names="12" />
			</output>
		</layer>
		<layer id="67" name="__module.model.down_blocks.0.resnets.0/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="127">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6813160" size="8" />
			<output>
				<port id="0" precision="I64" names="11" />
			</output>
		</layer>
		<layer id="69" name="__module.model.down_blocks.0.resnets.0/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="128,temb.1">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.down_blocks.0.resnets.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="129,input.17">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="self.model.down_blocks.0.resnets.0.norm2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320" offset="6813168" size="640" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.resnets.0.norm2.weight">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="self.model.down_blocks.0.resnets.0.norm2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="self.model.down_blocks.0.resnets.0.norm2.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320" offset="6813808" size="640" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.resnets.0.norm2.bias">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="self.model.down_blocks.0.resnets.0.norm2.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.down_blocks.0.resnets.0.norm2/aten::group_norm/GroupNormalization" type="GroupNormalization" version="opset12">
			<data num_groups="32" epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="132,input.19">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.conv_act/aten::silu/Swish_3" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="133,input.21">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="self.model.down_blocks.0.resnets.0.conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320, 320, 3, 3" offset="6814448" size="1843200" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.resnets.0.conv2.weight">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="self.model.down_blocks.0.resnets.0.conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.model.down_blocks.0.resnets.0.conv2/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.model.down_blocks.0.resnets.0.conv2/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 320, 1, 1" offset="8657648" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.down_blocks.0.resnets.0.conv2/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.model.down_blocks.0.resnets.0.conv2/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="141,hidden_states.3">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.model.down_blocks.0.resnets.0/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="142,143,hidden_states.5">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="self.model.down_blocks.0.attentions.0.norm.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320" offset="8658288" size="640" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.attentions.0.norm.weight">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="self.model.down_blocks.0.attentions.0.norm.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="self.model.down_blocks.0.attentions.0.norm.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320" offset="8658928" size="640" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.attentions.0.norm.bias">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="self.model.down_blocks.0.attentions.0.norm.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.down_blocks.0.attentions.0.norm/aten::group_norm/GroupNormalization" type="GroupNormalization" version="opset12">
			<data num_groups="32" epsilon="9.9999999747524271e-07" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="159,input.25">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="self.model.down_blocks.0.attentions.0.proj_in.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320, 320, 1, 1" offset="8659568" size="204800" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.attentions.0.proj_in.weight">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="self.model.down_blocks.0.attentions.0.proj_in.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.down_blocks.0.attentions.0.proj_in/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.down_blocks.0.attentions.0.proj_in/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 320, 1, 1" offset="8864368" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.down_blocks.0.attentions.0.proj_in/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.down_blocks.0.attentions.0.proj_in/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="166,hidden_states.7">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_514" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8865008" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.model.down_blocks.0.attentions.0/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>320</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="169">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_61314" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8865040" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.model.down_blocks.0.attentions.0/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="173,hidden_states.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.norm1/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8865064" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_58348_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 320" offset="8865068" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_58348" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.norm1/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_58349_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 320" offset="8865708" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_58349" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="183,hidden_states.11">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="self.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1.to_q.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320, 320" offset="8866348" size="204800" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1.to_q.weight">
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="self.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1.to_q.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1.to_q/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191,query.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_61315" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="9071148" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="203">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="9071180" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204,query.3">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="self.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1.to_k.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="320, 320" offset="9071196" size="204800" />
			<output>
				<port id="0" precision="FP16" names="self.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1.to_k.weight">
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="self.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1.to_k.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.down_blocks.0.attentions.0.transformer_blocks.0.attn1.to_k/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="193,key.1">
					<dim>-1</dim>
					<dim>-1</dim>
